#ifndef __BEEP_H
#define __BEEP_H	 
#include "sys.h"
#include "delay.h"


/*******************************************************本程序开源供3D打印学习使用************************************************
																												Dlion-3D打印主板
																												3D二进制创客---------技术论坛:www.3dbinmaker.com
																												文件说明：蜂鸣器驱动代码   版本：V1.0
																												Copyright(C)深圳洛众科技有限公司
																												All rights reserved
***********************************************************************************************************************************/


//蜂鸣器端口定义
#define BEEP PEout(4)	// BEEP,蜂鸣器接口		   

void BEEP_Init(void);	//初始化
void beep(void);		 				    
#endif

